// 定義堅果組合資料
export const nutsData = {
  元氣組合: {
    核桃: 25,
    杏仁果: 20,
    南瓜籽: 15,
    胡桃: 25,
    夏威夷豆: 15,
  },
  美妍組合: {
    杏仁果: 25,
    南瓜籽: 15,
    榛果: 20,
    夏威夷豆: 20,
    胡桃: 20,
  },
  健身組合: {
    腰果: 40,
    杏仁果: 25,
    南瓜籽: 15,
    核桃: 10,
    巴西豆: 10,
  },
  楓糖肉桂核桃: {
    楓糖漿: 11.5,
    肉桂粉: 3.1,
    核桃: 85.4,
  },
  花椒巧克力腰果: {
    楓糖漿: 12.5,
    花椒粉: 1.1,
    可可粉: 3.4,
    腰果: 83.0,
  },
  椰蓉咖哩核桃: {
    楓糖漿: 12.1,
    咖哩粉: 2.4,
    肉桂粉: 0.6,
    核桃: 78.8,
    椰蓉: 6.1,
  },
  海鹽迷迭香腰果: {
    楓糖漿: 7.8,
    迷迭香粉: 0.6,
    海鹽: 0.5,
    腰果: 91.1,
  },
  蒜香胡椒腰果: {
    楓糖漿: 8.5,
    大蒜粉: 6.4,
    黑胡椒粒: 2.8,
    海鹽: 0.8,
    腰果: 81.5,
  },
  墨西哥塔可腰果: {
    腰果: 87.0,
    墨西哥塔可粉: 4.3,
    楓糖漿: 8.7,
  },
  義式火辣腰果: {
    楓糖漿: 8.4,
    雞心辣椒粉: 6.4,
    海鹽: 1.3,
    義式香腸綜合香料: 1.4,
    腰果: 82.5,
  },
  紅玉18號腰果: {
    腰果: 83.3,
    紅玉18號茶粉: 4.2,
    楓糖漿: 12.5,
  },
};



// 每100克的營養價值
export const nutritionData = {
  "腰果": { 熱量: 553, 蛋白質: 18.2, 脂肪: 43.9, 飽和脂肪: 7.8, 反式脂肪: 0, 碳水: 30.2, 糖: 5.9, 膳食纖維: 3.3, 鈉: 12, 不飽和脂肪酸: 36.1 },
  "核桃": { 熱量: 654, 蛋白質: 15.2, 脂肪: 65.2, 飽和脂肪: 6.1, 反式脂肪: 0, 碳水: 13.7, 糖: 2.6, 膳食纖維: 6.7, 鈉: 2, 不飽和脂肪酸: 59.1 },
  "夏威夷豆": { 熱量: 718, 蛋白質: 7.9, 脂肪: 76.1, 飽和脂肪: 12, 反式脂肪: 0, 碳水: 13.8, 糖: 4.6, 膳食纖維: 8.6, 鈉: 5, 不飽和脂肪酸: 64.1 },
  "杏仁果": { 熱量: 575, 蛋白質: 21.2, 脂肪: 49.4, 飽和脂肪: 3.7, 反式脂肪: 0, 碳水: 21.7, 糖: 4.4, 膳食纖維: 12.5, 鈉: 1, 不飽和脂肪酸: 45.7 },
  "榛果": { 熱量: 628, 蛋白質: 15, 脂肪: 60.8, 飽和脂肪: 4.5, 反式脂肪: 0, 碳水: 16.7, 糖: 4.3, 膳食纖維: 9.7, 鈉: 0, 不飽和脂肪酸: 56.3 },
  "胡桃": { 熱量: 654, 蛋白質: 15.2, 脂肪: 65.2, 飽和脂肪: 6.1, 反式脂肪: 0, 碳水: 13.7, 糖: 2.6, 膳食纖維: 6.7, 鈉: 2, 不飽和脂肪酸: 59.1 },
  "南瓜籽": { 熱量: 574, 蛋白質: 29.8, 脂肪: 49.1, 飽和脂肪: 8.7, 反式脂肪: 0, 碳水: 14.7, 糖: 1.3, 膳食纖維: 6, 鈉: 7, 不飽和脂肪酸: 40.4 },
  "巴西豆": { 熱量: 659, 蛋白質: 14.3, 脂肪: 67.1, 飽和脂肪: 15.1, 反式脂肪: 0, 碳水: 11.7, 糖: 2.3, 膳食纖維: 7.5, 鈉: 3, 不飽和脂肪酸: 52.0 },

  "椰蓉": { 熱量: 690.1, 蛋白質: 7.4, 脂肪: 60.5, 飽和脂肪: 57.4, 反式脂肪: 0, 碳水: 29, 糖: 7.8, 膳食纖維: 0, 鈉: 13 },
  "楓糖漿": { 熱量: 367, 蛋白質: 0, 脂肪: 0, 飽和脂肪: 0, 反式脂肪: 0, 碳水: 91.7, 糖: 80, 膳食纖維: 0, 鈉: 17 },
  "花椒粉": { 熱量: 255, 蛋白質: 10.8, 脂肪: 3.3, 飽和脂肪: 0.8, 反式脂肪: 0, 碳水: 50.6, 糖: 1.6, 膳食纖維: 33.5, 鈉: 7 },
  "可可粉": { 熱量: 321.4, 蛋白質: 19.5, 脂肪: 23, 飽和脂肪: 13.8, 反式脂肪: 0, 碳水: 9.1, 糖: 0.4, 膳食纖維: 0, 鈉: 16 },
  "咖哩粉": { 熱量: 325, 蛋白質: 14, 脂肪: 14, 飽和脂肪: 2.4, 反式脂肪: 0, 碳水: 58, 糖: 4.5, 膳食纖維: 33.4, 鈉: 52 },
  "肉桂粉": { 熱量: 240, 蛋白質: 3.5, 脂肪: 1.3, 飽和脂肪: 0.9, 反式脂肪: 0, 碳水: 51, 糖: 0, 膳食纖維: 0, 鈉: 8 },
  "迷迭香粉": { 熱量: 331, 蛋白質: 4.9, 脂肪: 15.2, 飽和脂肪: 7.4, 反式脂肪: 0, 碳水: 64.1, 糖: 1.2, 膳食纖維: 42.6, 鈉: 50 },
  "海鹽": { 熱量: 0, 蛋白質: 0, 脂肪: 0, 飽和脂肪: 0, 反式脂肪: 0, 碳水: 0, 糖: 0, 膳食纖維: 0, 鈉: 38758 },
  "大蒜粉": { 熱量: 331, 蛋白質: 16.6, 脂肪: 0.7, 飽和脂肪: 0.2, 反式脂肪: 0, 碳水: 72.7, 糖: 2.4, 膳食纖維: 9.0, 鈉: 60 },
  "黑胡椒粒": { 熱量: 255, 蛋白質: 10.4, 脂肪: 3.3, 飽和脂肪: 1.4, 反式脂肪: 0, 碳水: 64, 糖: 0, 膳食纖維: 26.5, 鈉: 20 },
  "墨西哥塔可粉": { 熱量: 150, 蛋白質: 7, 脂肪: 4, 飽和脂肪: 0.5, 反式脂肪: 0, 碳水: 25, 糖: 6, 膳食纖維: 4, 鈉: 900 },
  "雞心辣椒粉": { 熱量: 282, 蛋白質: 12, 脂肪: 14, 飽和脂肪: 2.5, 反式脂肪: 0, 碳水: 50, 糖: 6, 膳食纖維: 20, 鈉: 68 },
  "義式香腸綜合香料": { 熱量: 305, 蛋白質: 11, 脂肪: 14, 飽和脂肪: 1, 反式脂肪: 0, 碳水: 50, 糖: 8, 膳食纖維: 20, 鈉: 220 },
  "紅玉18號茶粉": { 熱量: 312, 蛋白質: 20, 脂肪: 2, 飽和脂肪: 0.5, 反式脂肪: 0, 碳水: 72, 糖: 0, 膳食纖維: 25, 鈉: 20 },
};



// 堅果價格資料
export const nutPrices = {
  杏仁果: 393,
  腰果: 475,
  核桃: 483,
  夏威夷豆: 750,
  榛果: 615,
  胡桃: 617,
  巴西豆: 833,
  南瓜籽: 300,
};

// 原物料價格資料
export const materialPrices = {
  可可粉: 1000,
  花椒粉: 850,           // (510 ÷ 0.6)
  雞心辣椒粉: 600,       // (360 ÷ 0.6)
  迷迭香粉: 583.33,      // (350 ÷ 0.6)
  卡宴辣椒粉: 500,       // (300 ÷ 0.6)
  青花椒粉: 1083.33,     // (650 ÷ 0.6)
  肉桂粉: 500,           // (300 ÷ 0.6)
  咖哩粉: 500,           // (300 ÷ 0.6)
  椰蓉: 177.33,          // (532 ÷ 3)
  海鹽: 99,              // (198 ÷ 2)
  楓糖漿: 519,           // 每升直接視為1公斤價格
  紅玉18號茶粉: 1166.67, // (350 ÷ 0.3)
  大蒜粉: 550,           // (550 ÷ 1)
  黑胡椒粒: 900,         // (180 ÷ 0.2)
  義式香腸綜合香料: 800, // (80 ÷ 0.1)
  墨西哥塔可粉: 800,     // (80 ÷ 0.1)
};

export const totalPrices = {
  ...nutPrices,
  ...materialPrices
}

// 根據莫蘭迪色系進行配色，適合壓白色字
export const nutColors = {
  // 堅果類
  核桃: '#6E4F3A', // 深棕色
  杏仁果: '#C4A99A', // 暖棕杏色
  南瓜籽: '#556B4B', // 深莫蘭迪綠
  巴西豆: '#D5B79F', // 暖灰米色
  胡桃: '#7A473D', // 暗紅棕色
  夏威夷豆: '#C7B69E', // 深奶白色
  榛果: '#6C453E', // 深褐色
  腰果: '#C5A683', // 濃暖米色

  // 調味料類
  楓糖漿: '#8E6B4F', // 深焦糖色
  咖哩粉: '#A17A3D', // 濃黃褐色
  雞心辣椒粉: '#993F2B', // 溫暖深紅色
  肉桂粉: '#805337', // 濃棕褐色
  海鹽: '#98A7AC', // 深灰藍色
  可可粉: '#3B2A25', // 深棕巧克力色
  迷迭香粉: '#4C6248', // 深草綠色
  椰蓉: '#D8C9A6', // 深奶白色
  花椒粉: '#8A4B3C', // 深橙褐色
  大蒜粉: '#C8B696', // 深米黃色
  黑胡椒粒: '#423634', // 深灰黑色
  義式香腸綜合香料: '#7D4A3A', // 深棕橘色
  墨西哥塔可粉: '#A45E3D', // 濃橙棕色
  紅玉18號茶粉: '#6A3E2E', // 深紅棕色
};


