// 定義堅果組合資料
export const nutsData = {
  元氣組合: {
    核桃: 20,
    杏仁果: 20,
    南瓜籽: 20,
    胡桃: 25,
    夏威夷豆: 15,
  },
  美妍組合: {
    杏仁果: 25,
    南瓜籽: 30,
    榛果: 15,
    夏威夷豆: 15,
    胡桃: 15,
  },
  健身組合: {
    腰果: 30,
    杏仁果: 30,
    南瓜籽: 20,
    核桃: 10,
    巴西豆: 10,
  },
  楓糖肉桂: {
    核桃: 82.54,
    楓糖漿: 15.01,
    肉桂粉: 1.95,
    海鹽: 0.54,
  },
  辣味巧克力: {
    腰果: 79.55,
    楓糖漿: 12.81,
    卡宴辣椒粉: 3.66,
    青花椒粉: 0.40,
    法芙娜巧克力粉: 3.58,
  },
  椰蓉咖哩: {
    核桃: 84.28,
    楓糖漿: 12.26,
    咖哩粉: 1.99,
    肉桂粉: 0.92,
    海鹽: 0.55,
  },
  海鹽迷迭香: {
    腰果: 85.55,
    楓糖漿: 12.44,
    迷迭香粉: 1.55,
    海鹽: 0.47,
  },
};


// 每100克的營養價值
export const nutritionData = {
  "腰果": { 熱量: 553, 蛋白質: 18.2, 脂肪: 43.9, 飽和脂肪: 7.8, 反式脂肪: 0, 碳水: 30.2, 糖: 5.9, 膳食纖維: 3.3, 鈉: 12, 不飽和脂肪酸: 36.1 },
  "核桃": { 熱量: 654, 蛋白質: 15.2, 脂肪: 65.2, 飽和脂肪: 6.1, 反式脂肪: 0, 碳水: 13.7, 糖: 2.6, 膳食纖維: 6.7, 鈉: 2, 不飽和脂肪酸: 59.1 },
  "夏威夷豆": { 熱量: 718, 蛋白質: 7.9, 脂肪: 76.1, 飽和脂肪: 12, 反式脂肪: 0, 碳水: 13.8, 糖: 4.6, 膳食纖維: 8.6, 鈉: 5, 不飽和脂肪酸: 64.1 },
  "杏仁果": { 熱量: 575, 蛋白質: 21.2, 脂肪: 49.4, 飽和脂肪: 3.7, 反式脂肪: 0, 碳水: 21.7, 糖: 4.4, 膳食纖維: 12.5, 鈉: 1, 不飽和脂肪酸: 45.7 },
  "榛果": { 熱量: 628, 蛋白質: 15, 脂肪: 60.8, 飽和脂肪: 4.5, 反式脂肪: 0, 碳水: 16.7, 糖: 4.3, 膳食纖維: 9.7, 鈉: 0, 不飽和脂肪酸: 56.3 },
  "胡桃": { 熱量: 654, 蛋白質: 15.2, 脂肪: 65.2, 飽和脂肪: 6.1, 反式脂肪: 0, 碳水: 13.7, 糖: 2.6, 膳食纖維: 6.7, 鈉: 2, 不飽和脂肪酸: 59.1 },
  "南瓜籽": { 熱量: 574, 蛋白質: 29.8, 脂肪: 49.1, 飽和脂肪: 8.7, 反式脂肪: 0, 碳水: 14.7, 糖: 1.3, 膳食纖維: 6, 鈉: 7, 不飽和脂肪酸: 40.4 },
  "巴西豆": { 熱量: 659, 蛋白質: 14.3, 脂肪: 67.1, 飽和脂肪: 15.1, 反式脂肪: 0, 碳水: 11.7, 糖: 2.3, 膳食纖維: 7.5, 鈉: 3, 不飽和脂肪酸: 52.0 }
};


// 堅果價格資料
export const nutPrices = {
  杏仁果: 333,
  腰果: 475,
  核桃: 367,
  夏威夷豆: 750,
  榛果: 584,
  胡桃: 617,
  巴西豆: 833,
  南瓜籽: 300,
};

// 原物料價格資料
export const materialPrices = {
  楓糖漿: 377,
  法芙娜巧克力粉: 1200,
  迷迭香粉: 584,
  卡宴辣椒粉: 500,
  青花椒粉: 1084,
  肉桂粉: 500,
  椰蓉: 500,
  海鹽: 120,
  咖哩粉: 500,
};

export const totalPrices = {
  ...nutPrices,
  ...materialPrices
}

// 根據莫蘭迪色系進行配色
export const nutColors = {
  // 堅果類
  核桃: '#8E735B', // 深灰褐色
  杏仁果: '#D3B8AE', // 柔和杏色
  南瓜籽: '#78866B', // 莫蘭迪綠
  巴西豆: '#E4D6C1', // 米色
  胡桃: '#A47463', // 暗紅褐色
  夏威夷豆: '#EDE3D2', // 淡米色
  榛果: '#7F5A58', // 深褐色
  腰果: '#DCC8A4', // 暖米色,

  // 調味料類
  楓糖漿: '#B08B6E', // 焦糖棕色
  咖哩粉: '#C6A15B', // 柔和黃褐色
  卡宴辣椒粉: '#B35A42', // 溫暖紅色
  青花椒粉: '#9A9C68', // 柔和橄欖綠
  肉桂粉: '#A66E4A', // 柔和棕褐色
  海鹽: '#D4E1E3', // 柔和灰藍色
  法芙娜巧克力粉: '#4E3B31', // 深棕巧克力色
  迷迭香粉: '#6D8268', // 莫蘭迪草綠色
};

