// ./lib/nutData.js

// 定義堅果組合資料
export const nutsData = {
  活腦組合: {
    核桃: 35,
    杏仁果: 25,
    南瓜籽: 20,
    巴西豆: 10,
    胡桃: 10,
    夏威夷豆: 0,
    腰果: 0,
    榛果: 0,
  },
  美肌組合: {
    杏仁果: 35,
    南瓜籽: 25,
    榛果: 20,
    夏威夷豆: 10,
    胡桃: 10,
    巴西豆: 0,
    核桃: 0,
    腰果: 0,
  },
  健身組合: {
    腰果: 30,
    杏仁果: 25,
    南瓜籽: 20,
    核桃: 15,
    巴西豆: 10,
    胡桃: 0,
    夏威夷豆: 0,
    榛果: 0,
  },
  楓糖肉桂: {
    杏仁果: 0,
    核桃: 45,
    夏威夷豆: 0,
    腰果: 30,
    榛果: 10,
    胡桃: 15,
    巴西豆: 0,
    南瓜籽: 0,
  },
  辣味巧克力: {
    杏仁果: 10,
    核桃: 35,
    夏威夷豆: 0,
    腰果: 30,
    榛果: 25,
    胡桃: 0,
    巴西豆: 0,
    南瓜籽: 0,
  },
  椰蓉咖哩: {
    杏仁果: 15,
    核桃: 35,
    夏威夷豆: 0,
    腰果: 35,
    榛果: 0,
    胡桃: 15,
    巴西豆: 0,
    南瓜籽: 0,
  },
  海鹽迷迭香: {
    杏仁果: 20,
    核桃: 35,
    夏威夷豆: 0,
    腰果: 30,
    榛果: 15,
    胡桃: 0,
    巴西豆: 0,
    南瓜籽: 0,
  },
};


// 堅果價格資料
export const nutPrices = {
  杏仁果: 470,
  腰果: 620,
  核桃: 535,
  夏威夷豆: 950,
  榛果: 620,
  胡桃: 830,
  巴西豆: 1200,
  南瓜籽: 400,
};

// 根據莫蘭迪色系進行配色
export const nutColors = {
  核桃: '#8E735B', // 深灰褐色
  杏仁果: '#D3B8AE', // 柔和杏色
  南瓜籽: '#78866B', // 莫蘭迪綠
  巴西豆: '#E4D6C1', // 米色
  胡桃: '#A47463', // 暗紅褐色
  夏威夷豆: '#EDE3D2', // 淡米色
  榛果: '#7F5A58', // 深褐色
  腰果: '#DCC8A4', // 暖米色
};
